# Задание 1

a = int(input('Введите первое число: '))
b = int(input('Введите второе число: '))
c = int(input('Введите третье число: '))
print('Сумма чисел:', a+b+c)
print('Произведение чисел:', a*b*c)

# Задание 2

salary = int(input('Введите зарплату за месяц: '))
credit = int(input('Введите сумму платежа по кредиту: '))
utilities = int(input('Введите задолженность за коммунальные услуги: '))
print('У Вас остается:', salary - credit - utilities)

# Задание 3

side1 = int(input('Введите длину первой диагонали: '))
side2 = int(input('Введите длину второй диагонали: '))
print('Площадь ромба  равна:', int((side1*side2)/2))

# Задание 4

print('To be\nor not\nto be')

# Задание 5

print('"Life is what happens\n      when\n         you`re busy making other plans"\n'
      '                                      John Lennon.')